

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	
	РассчитатьСумму();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	
	РассчитатьСумму();
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСумму()	
	
	//получение текущих Данных Формы	
	ТекСтрока = Элементы.СписокТоваров.ТекущиеДанные;	
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварПриИзменении(Элемент) 
	
	ТекСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	ТекСтрока.Цена = СписокТоваровТоварПриИзмененииНаСервере(ТекСтрока.Товар); 
	// пересчитываем сумму при изменении Цены
	РассчитатьСумму()
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция  СписокТоваровТоварПриИзмененииНаСервере(Товар)
	
	Возврат Товар.Цена;
	
КонецФункции


