


Процедура Печать2(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать2)
	Макет = Документы.Продажи.ПолучитьМакет("Печать2");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Дата,
	|	Продажи.Номер,
	|	Продажи.СписокТоваров.(
	|		НомерСтроки,
	|		Товар,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокТоваровШапка = Макет.ПолучитьОбласть("СписокТоваровШапка");
	ОбластьСписокТоваров = Макет.ПолучитьОбласть("СписокТоваров");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокТоваровШапка);
		ВыборкаСписокТоваров = Выборка.СписокТоваров.Выбрать();
		Пока ВыборкаСписокТоваров.Следующий() Цикл
			ОбластьСписокТоваров.Параметры.Заполнить(ВыборкаСписокТоваров);
			ТабДок.Вывести(ОбластьСписокТоваров, ВыборкаСписокТоваров.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
