
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	// создаем Документ	
	ТабДок = Новый ТабличныйДокумент;

	ПечатьНасервере(ТабДок, ПараметрКоманды);
	
	ТабДок.Показать();

КонецПроцедуры



&НаСервере
Процедура ПечатьНасервере(ТабДок, ПараметрКоманды);
	
	//получаем Макет & Область 
	Макет = Документы.Продажи.ПолучитьМакет("Макет");
	ОбластьПечати = Макет.ПолучитьОбласть("ОбластьПечати"); 
	
	//перебираем Массив Ссылок
	Для каждого СсылкаДок Из ПараметрКоманды Цикл
		
		// Заполняем Параметры
		ОбластьПечати.Параметры.Заполнить(СсылкаДок);
		
		// выводим Область
		ТабДок.Вывести(ОбластьПечати);		
	
	КонецЦикла;	
	
КонецПроцедуры
