

&НаКлиенте
Процедура ВыбратьФайл1(Команда)
	
	// 1. Описание Оповещения о Завершении → указание на процедуру, вызываемую по ИТОГУ выполнения
	// 2. Описание Оповещения о Ходе  → указание на процедуру, вызываемую по ХОДУ выполнения (прогресс-бар)
	// 3. Описание Оповещения перед началом   → можно узнать тип/размер файла
	// 4.
	// 5. Параметры диалога: можно ограничить выбор по типу Файла
	// 6. Уникальный ИД Формы : связь Временного Хранилища с Формой (надо хранить эту связь !!!!)
	
	ОписаниеОЗавершении = Новый  ОписаниеОповещения("ЗавершенВыборФайла", ЭтотОбъект);
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОЗавершении,,,,,УникальныйИдентификатор); 
	
	
КонецПроцедуры



&НаКлиенте
Процедура ЗавершенВыборФайла(ОписаниеФайла, ДопПарметры)   Экспорт 
		
	Если НЕ ОписаниеФайла.ПомещениеФайлаОтменено Тогда
	     // пока  "жива форма"
		 АдресКартинки = ОписаниеФайла.Адрес; 
	
	КонецЕсли;
	
КонецПроцедуры
