
// 1. Описание Оповещения о Завершении → указание на процедуру, вызываемую по ИТОГУ выполнения
// 2. Описание Оповещения о Ходе  → указание на процедуру, вызываемую по ХОДУ выполнения (прогресс-бар)
// 3. Описание Оповещения перед началом   → можно узнать тип/размер файла
// 4.
// 5. Параметры диалога: можно ограничить выбор по типу Файла
// 6. Уникальный ИД Формы : связь Временного Хранилища с Формой (надо хранить эту связь !!!!)
&НаКлиенте
Процедура ВыбратьФайл1(Команда)
	
	ОписаниеОЗавершении = Новый  ОписаниеОповещения("ЗавершенВыборФайла", ЭтотОбъект);
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОЗавершении,,,,,УникальныйИдентификатор); 
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершенВыборФайла(ОписаниеФайла, ДопПарметры)   Экспорт 
	
	Если НЕ ОписаниеФайла.ПомещениеФайлаОтменено Тогда  
		// * на форме, к команде НЕ привязываем  
		Модифицированность = Истина;
		// пока "жива форма"
		АдресКартинки = ОписаниеФайла.Адрес; 
		
	КонецЕсли;
	
КонецПроцедуры         


// 1. Отказ →  Признак отказа от записи (вызываем, если что топошло не так
// 2. ТекущийОбъект → Записываемый объект
// 3. ПараметрыЗаписи →
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда 
		
		ТекущийОбъект.ДанныеКартинки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки)); 
		
	КонецЕсли;
	
КонецПроцедуры


// показываем Картинку
// при Открытии Элемента Спр.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеКартинки");
	
КонецПроцедуры               


&НаКлиенте
Асинх Процедура ВыбратьФайл2(Команда)
	
	// → Обещание <> Неопределено 	
	Обещание = Ждать ПоместитьФайлНаСерверАсинх(,,,,УникальныйИдентификатор);  
	
	Если  Обещание = Неопределено Тогда
		Возврат;	
	Иначе
	
		АдресКартинки = Обещание.Адрес;
	
	КонецЕсли;

КонецПроцедуры


