

// При открытии Формы из Док. "Продажи" ловим СКЛАД	  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  
  Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);	
  
КонецПроцедуры

// отладка
&НаКлиенте
Процедура ПриОткрытии(Отказ)
  //Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
  
  // Отключаем, чтобы не закрывалась 	
  СтандартнаяОбработка = Ложь ;
  
  // Выбранную Строку добавляем в табл. Выбранные Товары
  НоваяСтрока = ВыбранныеТовары.Добавить(); 	
  НоваяСтрока.Товар = ВыбраннаяСтрока;
  //хардкодим одну штуку 
  НоваяСтрока.Количество = 1;
  
КонецПроцедуры

